In [5]:
!pip install pymysql
!pip install SQLAlchemy

Requirement already satisfied: pymysql in c:\anaconda3\lib\site-packages (1.0.2)
Requirement already satisfied: SQLAlchemy in c:\anaconda3\lib\site-packages (1.3.20)

In [22]:
import pymysql

In [101]:
db_conn = pymysql.connect(host='139.162.170.240',
                         user='nordic',
                         passwd ='password0',
                         db='nordicDB')

In [126]:
cursor = db_conn.cursor()

In [96]:
query = '''
    CREATE TABLE IF NOT EXISTS table_Balaev_K (
        `ID`INT PRIMARY KEY AUTO_INCREMENT NOT NULL,
        `name`TEXT,
        `surname`TEXT,
        `age`INT,
        `height`FLOAT)
'''

In [97]:
cursor.execute(query)

0

In [98]:
db_conn.commit()

In [103]:
query = '''
    INSERT INTO table_Balaev_K (
        name, surname, age, height
        )
        VALUES ('Николай', 'Николаев', '24', '1.59'),
        ('Алексей', 'Алексеев', '24', '1.65'),
        ('Анна', 'Аннова', '65', '1.56')
'''

In [104]:
cursor.execute(query)

3

In [120]:
db_conn.commit()

In [106]:
query = '''
     SELECT * FROM table_Balaev_K'''
cursor.execute(query)

5

In [107]:
cursor.fetchall()

((1, 'Илья', 'Петров', 21, 1.75),
 (2, 'Петр', 'Иванов', 17, 1.86),
 (4, 'Николай', 'Николаев', 24, 1.59),
 (5, 'Алексей', 'Алексеев', 24, 1.65),
 (6, 'Анна', 'Аннова', 65, 1.56))

In [51]:
cursor.fetchone()

(2, 'Петр', 'Иванов', 37, 1.86)

In [56]:
query = '''
     SELECT ID, name, surname, age FROM table_Balaev_K'''
cursor.execute(query)

2

In [57]:
cursor.fetchone()

(1, 'Илья', 'Петров', 21)

In [63]:
query = '''
     UPDATE table_Balaev_K
     SET age = 17
     WHERE name = "Петр"'''
cursor.execute(query)

0

In [73]:
query = '''
     DELETE FROM table_Balaev_K
     WHERE surname = "Николаев"'''
cursor.execute(query)

1

In [121]:
cursor.close()
db_conn.close()

In [122]:
db_conn = pymysql.connect(host='139.162.170.240',
                         user='nordic',
                         passwd ='password0',
                         db='nordicDB')

In [116]:
db_conn.close()

In [111]:
import pandas as pd

In [123]:
df = pd.read_sql("SELECT * FROM table_Balaev_K", db_conn, index_col = 'ID')

In [124]:
df

       name   surname  age  height
ID
1      Илья    Петров   21    1.75
2      Петр    Иванов   17    1.86
4   Николай  Николаев   24    1.59
5   Алексей  Алексеев   24    1.65
6      Анна    Аннова   65    1.56

In [140]:
query = '''
     SELECT * FROM table_Balaev_K
     WHERE name = "Илья" and surname = "Обама" and height = 1.70
     '''
cursor.execute(query)
df = pd.read_sql(query, db_conn, index_col = 'ID')
df

Empty DataFrame
Columns: [name, surname, age, height]
Index: []

In [144]:
query = '''
     SELECT * FROM table_Balaev_K
     WHERE (name = "Илья" or surname = "Иванов") and height >= 1.50
     '''
cursor.execute(query)
df = pd.read_sql(query, db_conn, index_col = 'ID')
df

    name surname  age  height
ID
1   Илья  Петров   21    1.75
2   Петр  Иванов   17    1.86

In [145]:
cursor.close()
db_conn.close()